<a href="https://colab.research.google.com/github/Ganapathi-tech/ganapathi-tech-Ganesh/blob/main/pandas_join.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

concat --> column labels (axis = 0) and index (axis = 1)

merge --> based on comman column and comman values.. 

join --> Joined based on the common index...

In [ ]:
d1 = {
    "Stdid" :[111,222,333,444,555],
    "StdName" : ["Shanti","Naren","Kumar","Shiva","Ram"],
    "StdClass" : [10, 7,9,10,12]
}


d2 = {
    "ENGLISH" :[88,77,81,67,75],
    "SCIENCE" : [89,72,83,75,79],
    "COMPUTERS" : [91,77,82,81,85]
}

d3 = {
    "Maths" :[88,77,81,67,75],
    "SOCIAL" : [89,72,83,75,79],
    "TELUGU" : [91,77,82,81,85]
}

In [ ]:
sdf1 = pd.DataFrame(d1)
sdf2 = pd.DataFrame(d2)
sdf3 = pd.DataFrame(d3)

In [ ]:
sdf1

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

In [ ]:
sdf2

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

In [ ]:
pd.concat([sdf1, sdf2])

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0  111.0  Shanti      10.0      NaN      NaN        NaN
1  222.0   Naren       7.0      NaN      NaN        NaN
2  333.0   Kumar       9.0      NaN      NaN        NaN
3  444.0   Shiva      10.0      NaN      NaN        NaN
4  555.0     Ram      12.0      NaN      NaN        NaN
0    NaN     NaN       NaN     88.0     89.0       91.0
1    NaN     NaN       NaN     77.0     72.0       77.0
2    NaN     NaN       NaN     81.0     83.0       82.0
3    NaN     NaN       NaN     67.0     75.0       81.0
4    NaN     NaN       NaN     75.0     79.0       85.0

In [ ]:
pd.concat([sdf1, sdf2], axis = 1)

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10       88       89         91
1    222   Naren         7       77       72         77
2    333   Kumar         9       81       83         82
3    444   Shiva        10       67       75         81
4    555     Ram        12       75       79         85

In [ ]:
pd.merge(sdf1, sdf2)

MergeError: ignored

In [ ]:
sdf1

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

In [ ]:
sdf2

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

In [ ]:
jdf = sdf1.join(sdf2)

In [ ]:
jdf

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10       88       89         91
1    222   Naren         7       77       72         77
2    333   Kumar         9       81       83         82
3    444   Shiva        10       67       75         81
4    555     Ram        12       75       79         85

In [ ]:
sdf2.join(sdf1)

   ENGLISH  SCIENCE  COMPUTERS  Stdid StdName  StdClass
0       88       89         91    111  Shanti        10
1       77       72         77    222   Naren         7
2       81       83         82    333   Kumar         9
3       67       75         81    444   Shiva        10
4       75       79         85    555     Ram        12

In [ ]:
display(sdf1, sdf2)

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

In [ ]:
sdf1

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

In [ ]:
sdf1.index = [11,22,33,44,55]

In [ ]:
sdf1

    Stdid StdName  StdClass
11    111  Shanti        10
22    222   Naren         7
33    333   Kumar         9
44    444   Shiva        10
55    555     Ram        12

In [ ]:
display(sdf1, sdf2)

    Stdid StdName  StdClass
11    111  Shanti        10
22    222   Naren         7
33    333   Kumar         9
44    444   Shiva        10
55    555     Ram        12

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

In [ ]:
sdf1.join(sdf2)

    Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
11    111  Shanti        10      NaN      NaN        NaN
22    222   Naren         7      NaN      NaN        NaN
33    333   Kumar         9      NaN      NaN        NaN
44    444   Shiva        10      NaN      NaN        NaN
55    555     Ram        12      NaN      NaN        NaN

In [ ]:
sdf2.join(sdf1)

   ENGLISH  SCIENCE  COMPUTERS  Stdid StdName  StdClass
0       88       89         91    NaN     NaN       NaN
1       77       72         77    NaN     NaN       NaN
2       81       83         82    NaN     NaN       NaN
3       67       75         81    NaN     NaN       NaN
4       75       79         85    NaN     NaN       NaN

In [ ]:
jdf

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10       88       89         91
1    222   Naren         7       77       72         77
2    333   Kumar         9       81       83         82
3    444   Shiva        10       67       75         81
4    555     Ram        12       75       79         85

In [ ]:
display(sdf1, sdf2,jdf)

    Stdid StdName  StdClass
11    111  Shanti        10
22    222   Naren         7
33    333   Kumar         9
44    444   Shiva        10
55    555     Ram        12

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10       88       89         91
1    222   Naren         7       77       72         77
2    333   Kumar         9       81       83         82
3    444   Shiva        10       67       75         81
4    555     Ram        12       75       79         85

In [ ]:
display(sdf1, sdf2,sdf3)

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

   Maths  SOCIAL  TELUGU
0     88      89      91
1     77      72      77
2     81      83      82
3     67      75      81
4     75      79      85

In [ ]:
pd.concat([sdf1, sdf2, sdf3], axis = 1)

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS  Maths  SOCIAL  TELUGU
0    111  Shanti        10       88       89         91     88      89      91
1    222   Naren         7       77       72         77     77      72      77
2    333   Kumar         9       81       83         82     81      83      82
3    444   Shiva        10       67       75         81     67      75      81
4    555     Ram        12       75       79         85     75      79      85

In [ ]:
sdf1.join([sdf2,sdf3])

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS  Maths  SOCIAL  TELUGU
0    111  Shanti        10       88       89         91     88      89      91
1    222   Naren         7       77       72         77     77      72      77
2    333   Kumar         9       81       83         82     81      83      82
3    444   Shiva        10       67       75         81     67      75      81
4    555     Ram        12       75       79         85     75      79      85

In [ ]:
sdf1

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

In [ ]:
sdf2

   ENGLISH  SCIENCE  COMPUTERS
0       88       89         91
1       77       72         77
2       81       83         82
3       67       75         81
4       75       79         85

In [ ]:
dic1 = {
    "Stdid" :[111,222,333,444,555],
    "StdName" : ["Shanti","Naren","Kumar","Shiva","Ram"],
    "StdClass" : [10, 7,9,10,12]
}


dic2 = {
    "Stdid" :[111,222,333,444,555],
    "ENGLISH" :[88,77,81,67, 85],
    "SCIENCE" : [89,72,83,75, 67],
    "COMPUTERS" : [91,77,82,81,71]
}

In [ ]:
dfdic1 = pd.DataFrame(dic1)
dfdic2 = pd.DataFrame(dic2)

In [ ]:
dfdic1

   Stdid StdName  StdClass
0    111  Shanti        10
1    222   Naren         7
2    333   Kumar         9
3    444   Shiva        10
4    555     Ram        12

In [ ]:
dfdic2

   Stdid  ENGLISH  SCIENCE  COMPUTERS
0    111       88       89         91
1    222       77       72         77
2    333       81       83         82
3    444       67       75         81
4    555       85       67         71

In [ ]:
dfdic1.join(dfdic2, how = "outer")

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10     88.0     89.0       91.0
1    222   Naren         7     77.0     72.0       77.0
2    333   Kumar         9     81.0     83.0       82.0
3    444   Shiva        10     67.0     75.0       81.0
4    555     Ram        12      NaN      NaN        NaN

In [ ]:
dfdic1.join(dfdic2, how = "inner" , )

   Stdid StdName  StdClass  ENGLISH  SCIENCE  COMPUTERS
0    111  Shanti        10       88       89         91
1    222   Naren         7       77       72         77
2    333   Kumar         9       81       83         82
3    444   Shiva        10       67       75         81

In [ ]:
dfdic1.join(dfdic2, lsuffix="_left", rsuffix="_right")

   Stdid_left StdName  StdClass  Stdid_right  ENGLISH  SCIENCE  COMPUTERS
0         111  Shanti        10          111       88       89         91
1         222   Naren         7          222       77       72         77
2         333   Kumar         9          333       81       83         82
3         444   Shiva        10          444       67       75         81
4         555     Ram        12          555       85       67         71

In [ ]:
dic3 = { 
    "city" : ["Hyd","Che","Viz"],
    "Temp" : [36,40,39],
    "Humd" : [45,52,50]

}
dic4 = { 
    "city1" : ["Mum","Kol", "Del"],
    "Temp1" : [40,43,38],
    "Humd1" : [45,52,50]

}

In [ ]:
dfdic3 = pd.DataFrame(dic3)

In [ ]:
dfdic4 = pd.DataFrame(dic4)

In [ ]:
display(dfdic3, dfdic4)

  city  Temp  Humd
0  Hyd    36    45
1  Che    40    52
2  Viz    39    50

  city1  Temp1  Humd1
0   Mum     40     45
1   Kol     43     52
2   Del     38     50

In [ ]:
pd.concat([dfdic3,dfdic4], axis = 0)

  city  Temp  Humd
0  Hyd    36    45
1  Che    40    52
2  Viz    39    50
0  Mum    40    45
1  Kol    43    52
2  Del    38    50

In [ ]:
dfdic3.append(dfdic4, ignore_index=True)

  city  Temp  Humd
0  Hyd    36    45
1  Che    40    52
2  Viz    39    50
3  Mum    40    45
4  Kol    43    52
5  Del    38    50

In [ ]:
dfdic3.append(dfdic4)

  city  Temp  Humd city1  Temp1  Humd1
0  Hyd  36.0  45.0   NaN    NaN    NaN
1  Che  40.0  52.0   NaN    NaN    NaN
2  Viz  39.0  50.0   NaN    NaN    NaN
0  NaN   NaN   NaN   Mum   40.0   45.0
1  NaN   NaN   NaN   Kol   43.0   52.0
2  NaN   NaN   NaN   Del   38.0   50.0